{
  "portfolio": [
    {
      "id": "1",
      "src": "./Images/Movie-quest.png",
      "title": "Movie-Quest",
      "description": "In my first collaborative experience with a team of five. I took the leadership role by delegating the roles to get this completed in 2 weeks. We began by building a Kanban for everyone to keep track of the work which laid the groundwork for our project. Followed by a thorough exploration of each member's preference. My responsibilities included integrating the Youtube API, optimizing local storage and building the card layouts using Bootstrap 5.",
      "link": " https://github.com/RootGeorge17/Movie-Quest"
    },
    {
      "id": "2",
      "src": "./Images/Weather-app.png",
      "title": "Weather-App",
      "description": "This weather application empowers users to search for the preferred cities, enabling them to see it in real time forecast for the current day and the subsequent five days. Additionally Users can save their cities for future references.",
      "link": " https://github.com/RootGeorge17/Movie-Quest"
    },
    {
      "id": "3",
      "src": "./Images/Anime-quest.png",
      "title": "Anime-Quest",
      "description": "This application is an engaging Anime Quiz that tests your knowledge with the popular animes. With a series of questions spanning various genres and themes.You will embark on an exciting journey to showcase your expertise. Be prepared for the challenge, as every wrong answer deducts 10 seconds from the timer, adding a thrilling element of time pressure to the quiz.Your score will be recorded and displayed in the highscore leaderboard, allowing you to compare your performance with other participants.",
      "link": "https://github.com/SKhail/Anime-Quiz"
    },
    {
      "id": "4",
      "src": "./Images/password-gen.png",
      "title": "Password-Generator",
      "description": "This application is a password generator that enables a user to generate a password by utlising a series of prompts. additionally added a feature to allow users to pick a choice of light/dark mode",
      "link": " https://github.com/SKhail/Password-Generator"
    }
  ]
}
